# 需求：
# 1. 用户输入手机号、密码、验证码
# 2. 对于输入的手机号、密码、验证码去除两端空格
number=input("请输出手机号：").strip()
passwd=input("请输入密码：").strip()
review=input("请输入验证码：").strip().lower()
# 3. 手机号为空时，提示“手机号不能为空”
if not number:
    print("手机号不能为空")
# 4. 密码为空时，提示“密码不能为空”
if not passwd:
    print("密码不能为空")
# 5. 验证码为空时，提示“验证码不能为空”
if not review:
    print("验证码不能为空")
# 6. 手机号格式不正确时，提示“手机号格式错误，请输入11位数字”
if len(number) != 11 or not number.isalnum():
    print("手机号格式错误，请输入11位数字")
# 7. 验证码统一转换为小写进行判断，正确验证码为“8888”，验证码错误、提示“验证码与图片内容不一致”
if review!="8888":
    print("验证码与图片内容不一致")
# 8. 正确手机号为“13488888888”，手机号错误时，提示“手机号不存在”
if number!="13488888888":
    print("手机号不存在")
    exit()
# 9. 正确密码为“123456”，密码错误时，提示“密码与账号不匹配”
if passwd!="123456":
    print("密码与账号不匹配")
    exit()
# 10. 手机号为“13488888888”，密码为“123456”，验证码为“8888”时，输出“登录成功”
if number=="13488888888" and passwd=="123456" and review=="8888":
    print("登录成功")
